[
  {
    "id": "1",
    "topic": "Анализ информационных моделей.",
    "difficulty": "1",
    "task_text": "На рисунке схема дорог изображена в виде графа, в таблице содержатся сведения о длине этих дорог в километрах. \nТак как таблицу и схему рисовали независимо друг от друга, то нумерация населённых пунктов в таблице никак не связана с буквенными обозначениями на графе. Определите длину дороги из пункта Б в пункт Г. В ответе запишите целое число.\nВНИМАНИЕ. Длины отрезков на схеме не отражают длины дорог.",
    "correct_answer": "56",
    "image": "images/task1.png",
    "solution": "1.Г— единственная вершина, степень которой 4, значит, Г соответствует П1.\n2.Л— единственная вершина, степень которой 1, значит, Л соответствует П5.\n3.К — единственная вершина, имеющая ребро с Л, значит, К соответствует П4.\n4.В — единственная вершина, степень которой 2, значит, В соответствует П3.\n5.Из пункта В(П3) можно идти либо в П2, либо в П6. И из пункта К(П4) можно идти либо в П8, либо в П2. Следовательно, Е соответствует П2, так как находится между В и К. А также А соответствует П6, Д соответствует П8.\n6.Методом исключения найдем вершину Б — это П7.\nТогда ответ — дорога из П7 в П1, ее длина равна 56.",
    "hint": "Найдите те вершины(пункты), степени которых уникальны. Степень вершины - количество рёбер(дорог), которые выходят из вершины."
  },
  {
    "id": "2",
    "topic": "Построение таблиц истинности логических выражений.",
    "difficulty": "1",
    "task_text": "Логическая функция F задаётся выражением:\n\n(w → ¬(z ≡ y)) ∧ (z ∨ (y → x)).\n\nДан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F. Определите, какому столбцу таблицы истинности соответствует каждая из переменных w, x, y, z.\n\nВ ответе напишите буквы w, x, y, z в том порядке, в котором идут соответствующие им столбцы (сначала буква, соответствующая первому столбцу; затем буква, соответствующая второму столбцу, и т.д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.",
    "correct_answer": "yxwz",
    "image": "images/task2.png",
    "solution": {
      "text": "Составим таблицу истинности для выражения (w → ¬(z ≡ y)) ∧ (z ∨ (y → x)).\n\nвручную или при помощи языка Python:",
      "code": "print(\"x y z w\")\nfor x in range(0, 2):\n    for y in range(0, 2):\n        for z in range(0, 2):\n            for w in range(0, 2):\n                if not((w <= (not(z == y))) and (z or(y <= x))):\n                    print(x, y, z, w)",
      "text_after": "Сопоставим полученные наборы с приведенным в задании фрагментом таблицы истинности.\n\nПервой и второй строкам могут соответствовать только наборы (0,0,0,1) и (0,1,0,0), тогда первый и третий столбцы могут соответствует переменным y и w (пока не известно в каком порядке).\n\nТретьей строке могут соответствовать наборы (0,1,0,1) и (1,0,0,1). Так как переменная w равнa 1 в обоих наборах, то первый столбец это переменная y. Тогда третий столбец соответствует переменной w.\n\nСледовательно третья строка может соответствовать только набору (1,0,0,1). Тогда переменной z соответствует четвертый столбец, а переменной x второй столбец."
    },
    "hint": "Первым делом, составьте таблицу истинности. Для этого выпишите все возможные перестановки 0 и 1 длины 4(так как у Вас 4 переменных: x, y, z, w). Затем разбейте логическое выражение по операциям и выполните их для каждого набора 0 и 1."
  },
  {
    "id": "3",
    "topic": "Кодирование и декодирование информации. Передача информации.",
    "difficulty": "1",
    "task_text": "Прибор автоматической фиксации нарушений правил дорожного движения делает цветные фотографии размером 1024×768 пикселей, используя палитру из 4096 цветов. Снимки сохраняются в памяти камеры, группируются в пакеты по несколько штук, а затем передаются в центр обработки информации со скоростью передачи данных 1310720 бит/с. Каково максимально возможное количество снимков в одном пакете, если на передачу одного пакета отводится не более 300 секунд? В ответе запишите целое число.",
    "correct_answer": "41",
    "solution": "1. Найдем глубину цвета (бит на пиксель):\n2^i = 4096 ⇒ i = 12 бит\n\n2. Найдем объем одной фотографии:\n1024 × 768 = 786432 пикселей\n786432 × 12 = 9437184 бит\n\n3. Найдем максимальный объем пакета:\n300 × 1310720 = 393216000 бит\n\n4. Найдем количество снимков:\n393216000 ÷ 9437184 ≈ 41,66\n\nОтвет: 41 снимок",
    "hint": "1. Определите количество бит для кодирования одного пикселя (формула Хартли: N = 2^i)\n2. Вычислите информационный объем одного снимка\n3. Найдите максимальный объем данных для передачи за 300 секунд\n4. Разделите объем пакета на объем одного снимка"
  },
  {
    "id": "4",
    "topic": "Вычисление количества информации.",
    "difficulty": "1",
    "task_text": "Каждый объект, зарегистрированный в информационной системе, получает уникальный код из двух частей. Первая часть определяет категорию объекта и состоит из 11 символов, каждый из которых может быть любой из 26 заглавных латинских букв. Вторая часть кода задаёт порядковый номер объекта внутри категории и может быть целым числом от 1 до 700. Для представления первой части кода используют посимвольное кодирование, все символы кодируют одинаковым минимально возможным количеством битов. Вторая часть кодируется как двоичное целое число с использованием минимально возможного количества битов. Для кода в целом выделяется минимально возможное целое количество байтов. Кроме того, для каждого объекта выделен одинаковый объём памяти для хранения дополнительных регистрационных данных.\n\nДля хранения кода и дополнительных регистрационных данных 44 объектов потребовалось 880 байт. Сколько байтов выделено для хранения дополнительных регистрационных данных одного объекта? В ответе запишите только целое число — количество байтов.",
    "correct_answer": "11",
    "solution": "Заметим, что для кодирования 26-символьного алфавита требуется 5 бит (так как 2⁵ = 32). Для хранения 11 символов потребуется 11 × 5 = 55 бит.\n\nДля хранения числа от 1 до 700 в двоичном виде требуется 10 бит.\n\nМинимальное количество байт, вмещающее в себя 55 + 10 = 65 бит — 9 байт (72 бита).\n\nТак как для хранения данных (код и дополнительные данные) о 44 объектах потребовалось 880 байт, для хранения данных об одном пользователе потребуется 880 ÷ 44 = 20 байт.\n\nДля хранения дополнительных данных об одном пользователе используется 20 - 9 = 11 байт.",
    "hint": "Вспомните формулу для определения количества бит на символ: N = 2^i, где N - мощность алфавита, i - количество бит. Для числа определите диапазон, который можно покрыть 2^i значениями."
  },
  {
    "id": "5",
    "topic": "Кодирование графической и звуковой информации",
    "difficulty": "2",
    "task_text": "Прибор автоматической фиксации нарушений правил дорожного поведения делает цветные фотографии размером 1024×768 пикселей, используя палитру из 4096 цветов. Для передачи снимки группируются в пакеты по 256 штук. Определите размер одного пакета фотографий в Мбайт.\nВ ответе запишите только число.",
    "correct_answer": "288",
    "image": "",
    "solution": "Один несжатый рисунок кодируется 12 битами, так как 2^12 = 4096. Всего 1024×768 = 786432 пикселей. Значит, одна фотография за-\nнимает:\n\n786 432 × 12 = 9 437 184 бит = 1 179 648 байт = 1152 Кбайт.\nРазмер одного пакета: 256 × 1152 = 294 912 Кбайт = 288 Мбайт.",
    "hint": "Определите глубину цвета в битах"
  },
  {
    "id": "6",
    "topic": "Позиционные системы счисления",
    "difficulty": "3",
    "task_text": "Операции арифметического выражения записаны в системе счисления с основанием 15:\n97968x15 + 7x23315.\n\nВ записи числа переменной x обозначена неизвестная цифра из алфавита 15-ричной системы счисления. Определите наименьшее значение x, при котором значение данного арифметического выражения кратно 14. Для найденного значения x вычислите частное от деления значения арифметического выражения на 14 и укажите его в ответе в десятичной системе счисления. Основание системы счисления указывать не нужно.",
    "correct_answer": " 116071912",
    "image": "",
    "solution": "```result_search = []\nfor x in '0123456789ABCDE':\n    t = int('97968' + x + '15', 15) + int('7' + x + '233', 15)\n    if t % 14 == 0:\n        result_search.append(t)\nif result_search:         \n    print(min(result_search) // 14)```",
    "hint": "Задача решается перебором"
  },
  {
    "id": "7",
    "topic": "Кодирование и декодирование данных. Условие Фано",
    "difficulty": "1",
    "task_text": "Все заглавные буквы русского алфавита закодированы неравномерным двоичным кодом, в котором никакое кодовое слово не является началом другого кодового слова. Это условие обеспечивает возможность однозначной расшифровки закодирован-ных сообщений. Кодовые слова для некоторых букв известны: И — 0011, Н — 00101, Ф — 101, О — 110, Р— 1001, М— 01, А—111, Т — 1000, К — 000. Укажите возможный код минимальной длины для буквы Й. Если таких кодов несколько, укажите тот из них, который имеет наименьшее числовое значение.",
    "correct_answer": "001000",
    "image": "",
    "solution": "Так как известны кодовые слова для букв И — 0011, Н — 00101, Ф — 101, О — 110, Р — 1001, М — 01, А — 111, Т — 1000, К — 000, то остаётся свободным только код 00100. Так как закодированы все буквы русского алфавита, то необходимо оставить один свободный код. Тогда возможный код минимальной длины для буквы Й будет 001000.",
    "hint": "Постройте дерево для уже имеющихся кодовых слов"
  }
]
